x1 = float(input('Введите координату: '))
y1 = float(input('Введите координату: '))
x2 = float(input('Введите координату: '))
y2 = float(input('Введите координату: '))
x3 = float(input('Введите координату: '))
y3 = float(input('Введите координату: '))
a = ((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
b = ((x3 - x2) ** 2 + (y3 - y2) ** 2) ** 0.5
c = ((x3 - x1) ** 2 + (y3 - y1) ** 2) ** 0.5
if a == b == c:
    print ('Этот треугольник - равносторонний')
elif a == b or b == c or a == c:
    print ('Этот треугольник - равнобедренный')
else:
    print ('Этот треугольник - разносторонний')